<?php

/* @var $this yii\web\View */

$this->title = 'Психологическая аналитика';
?>
<div class="site-index">
    <div class="body-content">

        <div class="row">
            <div class="col-lg-12">
                <h2>Наш сайт предназначен для профориентации. </h2>

                <p>В основании алгоритма расчета рекомендуемой сферы деятельности и профессии лежат
                оригинальные авторские разработки, в частности, таблица тем деятельности
                (и соответствующих качества человека), аналогичная таблице химических
                элементов Д.И. Менделеева.</p>
                <p>Для расчетов используется известный в кругу
                психологов метод квадрата Пифагора и психологические тесты. Если у вас
                сверхнадежная интуиция, и вы мгновенно принимаете стратегически
                выверенные решения, то этот сайт вам не нужен, только что для
                подтверждения своей правоты.</p>
                <p>Каждый человек обладает своим уникальным
                характером, темпераментом и способностями. У одного какое-то качество
                (например, воля) сильно развито. У другого его почти нет. У одного позитив,
                а у другого – негатив (безволие) или псевдо позитив (пустая страсть).
                Причем, по отношению к разным видам деятельности и к разным людям у
                человека это качество может проявляться всеми тремя способами. Поэтому
                классическая диагностика: интроверт – экстраверт, холерик – флегматик или
                рождение в знаке Стрельца дает очень общее и статичное представление о
                человеке, почти как средняя температура по больнице.</p>
                <p>В конечном итоге сайт остается хорошим и квалифицированным
                советчиком, предлагая процедуру поиска и высоковероятные альтернативы, а
                выбор и ответственность за него остаются за вами. Поэтому нужно быть
                внимательным и брать к сведению только то, что действительно легло на
                душу.</p>
                <p>В данный момент наш проект прошел долгий путь, в котором было создание концепции, разработка алгоритмов, ограниченное тестирование, пилотный проект, и, наконец, мы дошли до этапа открытого альфа-тестирования!</p>
                <p>Очень надеемся на взаимовыгодное сотрудничество, и что мы сможем помочь Вам найти себя!</p>

                <p>В данный момент, на нашем сайте работает только прогноз подходящих сфер деятельности и психологическое тестирование (результаты используются для увеличения точности рассчета)</p>
                <P>Для просмотра результатов, вам необходимо:</P>
                <p>1. Зарегистрироваться</p>
                <p><a class="btn btn-default" href="/web/authentication/login">Регистрация и авторизация</a></p>
                <p>2. Пройти так много психологических тестов как только возможно</p>
                <p><a class="btn btn-default" href="/web/testing/index">Психологические тесты</a></p>
                <p>3. Посмотреть результаты по предложениям профессий, а так же оставить отзыв на нашу оценку</p>
                <p><a class="btn btn-default" href="/web/site/profresults">Предложения по профессиям и сферам деятельности</a></p>
                <br>
                <p>Мы так же будем очень рады вашему отзыву на наш почтовый ящик:</p>
                <p><a class="btn btn-default" target="_blank" href="mailto:slepianok@gmail.com">Написать письмо</a></p>

            </div>
        </div>

    </div>
</div>
