(function () {

    'use strict';

    myApp.controller('schoolClassesController', schoolClassesController);
    
    schoolClassesController.$inject = ['$scope', '$uibModalInstance'];
    
    function schoolClassesController($scope, $uibModalInstance) { 
        $scope.classesList = ['Труд','Математика','Музыка','ИЗО','Язык','Литература','Иностранный язык','Биология','История','География','Химия','Физика','Информатика','Физкультура','МХК','Обществоведение','Ритмика'];  
        $scope.testName = "schoold_classes";
        $scope.testDescription = "Цель применения теста: выявление индивидуально-типологических различий на основе предпо-чтения школьных предметов. Инструкция проведения теста. Для приведенных ниже 17 школьных предметов по 10-бальной шкале (1-10) отметьте, в какой степени Вам нравился школьный предмет и учи-тель (учителя) по этому предмету.";
        $scope.titleList = [
            'Школьные предметы',
            'Оценка предмета',
            'Оценка учителя'
        ];
        $scope.modalInstance = $uibModalInstance;
        
        
        var school = [
                      [0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 10, 30, 0, 50, 0],
                      [10, 0, 0, 0, 0, 10, 30, 0, 0, 0, 0, 0, 20, 0, 0, 30, 0, 0],
                      [0, 20, 0, 30, 10, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10],
                      [0, 0, 0, 40, 10, 0, 0, 0, 0, 0, 0, 0, 20, 30, 0, 0, 0, 0],
                      [0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 90, 0, 0, 0, 0, 0],
                      [5, 5, 0, 30, 30, 20, 0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0],
                      [0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 90, 0, 0, 0, 0, 0],
                      [0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 10, 20, 50, 10],
                      [10, 10, 60, 0, 0, 0, 0, 0, 0, 10, 10, 0, 0, 0, 0, 0, 0, 0],
                      [0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 0, 30, 0, 0, 0, 20, 30, 0],
                      [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, 0, 90, 0, 0],
                      [0, 0, 0, 0, 0, 0, 0, 0, 20, 0, 0, 0, 10, 20, 0, 40, 10, 0],
                      [0, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 70, 10, 0, 10, 0, 0],
                      [0, 0, 0, 10, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 80],
                      [0, 10, 0, 70, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                      [30, 0, 30, 0, 0, 0, 0, 0, 0, 10, 20, 10, 0, 0, 0, 0, 0, 0],
                      [0, 0, 0, 0, 10, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 80]
                     ];
        $scope.outputData = outputData;
            
        function outputData(grades) {
            var T3 = [];
            for (var j = 0; j < 18; j++) { 
                var sum = 0;
                var i =0;
                var sum1 = 0;
                var length = $scope.classesList.length;
                for (; i < length; i++) { 
                    sum1 += (0,75 * grades[0][i] + 0,25 * grades[1][i]) * school[i][j];
                }
                i = 0;
                var sum2 = 0;
                for (; i < length; i++) { 
                    sum2 += school[i][j];
                }
                if (sum2 !== 0) { 
                  sum = sum1/sum2;
                }
                T3[j] = sum;
                
            }
            return T3;
        }
    }

})();